Autodesk.Revit.DB.ICloudExternalServer.GetProjects(System.String,System.String)
Gets all projects that are available to current login user from this Hub.
hubId:
Hub identity in ForgeDM.
region:
The Hub/BIM 360 Docs or Autodesk Docs account and project region.
Returns:
The list of Projects. Returns an empty list if there is no project in this Hub.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetHubs
Gets all hubs (of the supported regions) that are available to current login user.
Returns:
The list of Hubs. Returns an empty list if the current user doesn't have any hub.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetCloudModelInfo(System.Boolean,System.String,System.Guid,System.Guid,System.String@,System.String@,System.String@,System.String@,System.String@,System.String@)
Gets the cloud model and related forge infomation.
forceToTraverse:
Force use trasverse mode to skip off entitlement check, but with bad performance.
region:
The Hub/BIM 360 Docs or Autodesk Docs account and project region.
projectGUID:
The GUID of the cloud project which contains the model.
modelGUID:
The GUID of the Revit cloud model.
hubId:
Hub/BIM 360 Docs or Autodesk Docs account id.
projectId:
Project identity in BIM 360 Docs or Autodesk Docs.
projectName:
The name of the cloud project which contains the model as returned value.
folderUrn:
Folder identity in BIM 360 Docs or Autodesk Docs.
modelUrn:
Model identity in BIM 360 Docs or Autodesk Docs.
modelName:
The name of the Revit cloud model as returned value.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.EnsureGatewayClientInitialized
Indicates if the Gateway client is initialized using the global endpoint or not.
Remarks:
This method will try to initialize the gateway client if the client isn't already set up.
Returns:
Returns true if the Gateway client is initialized, otherwise returns false.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.HasBIM360Accounts
Indicates if the current login user has any BIM 360 Docs or Autodesk Docs accounts or not.
Returns:
Returns true if this ADSK account associated one or more BIM 360 Docs or Autodesk Docs accounts, otherwise returns false.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetCloudGUIDsByCloudModelInfo(System.String,System.String,System.String,System.String)
Gets RCM project GUID and model GUID from project id, folder id and model name.
Remarks:
Will be replaced by CloudModel in future.
CloudModel means the data comes from forgeDM.
region:
The BIM 360 Docs or Autodesk Docs account and project region.
projectId:
Project identity in BIM 360 Docs or Autodesk Docs.
folderId:
Folder identity in BIM 360 Docs or Autodesk Docs.
modelName:
Model name in BIM 360 Docs or Autodesk Docs.
Returns:
Returns a map including RCM project and model GUID.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetProjectInfoFromFolderLocationInformation(System.String,System.String,Autodesk.Revit.CloudProjectInfo)
accountId:
The BIM 360 Docs or Autodesk Docs account Id.
projectId:
The BIM 360 Docs or Autodesk Docs project Id.
data:
Cloud external data as output.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.IsValidUrn(System.String)
check if the uri string represents a valid URN.
uri:
Folder or model identity in BIM 360 Docs or Autodesk Docs.
Returns:
Returns true if the uri string represents a valid URN,
which also means it follows the prescribed format.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.PublishModel(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ModelPath)
pADoc:
Document to publish
modelPath:
Model path of the model to publish
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.Execute(Autodesk.Revit.CloudProjectInfo)
The method that Revit will invoke to get the cloud project information from C4R.
pCloudData:
Contains the input and output data for the execution.
Since:
2019